#include "rtthread.h"
#include "windgui.h"
#include "stm32f10x.h"

void delay_ms(unsigned int ms)
{
    ms /= 1000/RT_TICK_PER_SECOND;
    rt_thread_delay(ms);
}



/**************************************************************************
 *数学函数
 **************************************************************************/

/*
abs
原型　long abs(long x);
功能　求x的绝对值
说明　计算|x|, 当x为负数时返回-x，否则返回x
*/
//TODO:
long abs(long x)
{
    return x;
}

/*
Sin
原型　int Sin(int deg);
功能　计算Sin(deg)的值
说明　deg的单位是度，取0～32767之间的整数
      返回值是sin(deg)的小数值乘以1024（范围为-1024～1024）
*/
//TODO:
int Sin(int deg)
{
    return deg;
}
/*
Cos
原型　int Cos(int deg);
功能　计算Cos(deg)的值
说明　deg的单位是度，取0～32767之间的整数
      返回值是cos(deg)的小数值乘以1024（范围为-1024～1024）
*/
//TODO:
int Cos(int deg)
{
    return deg;
}

/*
rand
原型　int rand();
功能　取得一个随机数值
说明　返回值的范围是0～32767
*/
//TODO:
int rand()
{
    return 0;
}

/*
srand
原型　void srand(long x);
功能　用x初始化随机数发生器
说明　 
*/
//TODO:
void srand(long x)
{
    return;
}
/**************************************************************************
 *字符函数
 **************************************************************************/


/**************************************************************************
 *字符串函数
 **************************************************************************/

/**************************************************************************
 *文本模式下的字符显示函数
 **************************************************************************/

